[
  {
    "days": [
      {
        "day": 1,
        "theme": "Archanea (FE1, 3, 11, 12)",
        "descr": "Any memes or jokes relating to the adventures of every smash bros character.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 2,
        "theme": "FE OC day",
        "descr": "This is your chance to create your own FE OC. You can edit an existing character or create someone all by yourself, go ahead and tell us something about your character, maybe something about their stats and growths, their personality, their likes and dislikes.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 3,
        "theme": "Valentia (FE2, 15)",
        "descr": "Any memes or jokes relating to the adventures of green Marth and green Marth's dick sleeve.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 4,
        "theme": "Slander a chapter day",
        "descr": "Got a chapter that just really gets under your skin? Wanna make it someone else's problem? Well this is the day to do it whether you wanna drag your least favorite or you wanna bait people by dragging their favorite chapter this is your day to get some good old map discussion in. You can also talk about the story of chapters and how chapter 3 of FE7 really just ruins the whole FE timeline and story.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 5,
        "theme": "Jugdral (FE4. 5)",
        "descr": "Any memes or jokes relation to the adventures of Sigurd, diet Sigurd or Leif.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 6,
        "theme": "Official Media, OVA and Mangas",
        "descr": "Anything that has been officially released and trademarked under the Fire Emblem name is fair game. Whether this be the OVA, the mangas, the 4Karmas or anything else that isn't a video game that officially bears the name of Fire Emblem.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 7,
        "theme": "Elibe (FE 6, 7)",
        "descr": "Any memes that relate to the adventures red Marth and bigger red Marth.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 8,
        "theme": "Fire Emblem Heroes",
        "descr": "Any memes that relate to baby and man child's first gambling addiction.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 9,
        "theme": "Magvel (FE 8)",
        "descr": "Any memes relating to the incestuous duo and their adventures.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 10,
        "theme": "Low Quality MS Paint",
        "descr": "Whip out those drawing programs and ready up that mouse, it's time for some really shitty art. Use a low quality drawing program and a low quality drawing tool and let's see what abhorrent shit we can really make with this.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 11,
        "theme": "Tellius (FE 9, 10)",
        "descr": "Any memes relating to the twink turned twunk and his adventures through his first furry convention.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 12,
        "theme": "Romhacks",
        "descr": "Any unofficial, fan created FE game content would go here. If you have no idea what these are you really should find out what these are. Fans create some fire shit so let's give them some credit and drag them just as hard as we drag IS's shit.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 13,
        "theme": "Awakening (FE 13)",
        "descr": "Any memes or jokes relating to the adventures of a himbo and his amnesiac hobo friend.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 14,
        "theme": "Fates (FE BR, CQ Rev)",
        "descr": "Any memes relating to the almighty and benevolent god emperor of the incestuous albino and their magical ability to solve problems through sheer force of charisma alone.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 15,
        "theme": "Fire Emblem Good",
        "descr": "You know what? I think we have too much negativity on this sub, sometimes this series is alright so this is your chance to really lift up what makes this series so good that made you commit to making 25 memes in a row instead of wrapping Christmas presents during the busiest time of the year.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 16,
        "theme": "Fire Emblem Bad",
        "descr": "You know what? I think we have too much positivity on this sub, sometimes this series sucks ass so this is your chance to really drag it through the mud and show what makes this series so bad that you commit to 25 memes in a row instead of wrapping Christmas presents during the busiest time of the year.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 17,
        "theme": "3 Houses (FE 16)",
        "descr": "Time to flex your knowledge of the primary colors.\n\nNote: Any restricted memes relating to 3H will be allowed on this day and won't be subject to the low effort guidelines.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 18,
        "theme": "Smash Brothers (64, Melee, Brawl, 4, Ultimate)",
        "descr": "Any memes or jokes relating to that 1 game that has like 27 Marths in it and every time you complain about it we add 2 more. We are legion we are endless and Merlinus will be deposited into your game in 14 minutes.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 19,
        "theme": "TMS #FE",
        "descr": "Any memes or jokes relating to the funny kowashitai game.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 20,
        "theme": "Kirby",
        "descr": "We all know Kirby is the best Fire Emblem game so why not give him some love?",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 21,
        "theme": "Kaga Saga (TRS, BWS, VS)",
        "descr": "Did you know Kaga is still making games after he left Nintendo? Goofy stuff, pretty fire and some good meme material in these, I'd recommend them.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 22,
        "theme": "Fake FE leaks",
        "descr": "It's time to call up that uncle that works at Nintendo and tell us about the next FE game whether it be a new game or a remake. Tell us in detail of any changes to the FE formula the game is making, the title, how the trailer presented itself and anything else. Really just go ham on this, make something so fake it couldn't possibly be real.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 23,
        "theme": "FE adjacent games (Advance Wars, Final Fantasy Tactics, Valkyra Chronicles, Mario Rabbids, XCom etc)",
        "descr": "If it is based on a grid and has strategy elements, it's fair game. Time to shill your totally not FE but it's totally FE games or drag a game if it's cringe on a grid and has strategy elements.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 24,
        "theme": "FE in not FE",
        "descr": "Any official crossovers with Fire Emblem or maybe even a doctored image of Marth in Call of Duty. Let's spread our Smash influence to something that FE isn't already in and take over the world.",
        "participants": [],
        "megathread": ""
      },
      {
        "day": 25,
        "theme": "Christmas",
        "descr": "Wanna Thite Cranberry?",
        "participants": [],
        "megathread": ""
      }
    ],
    "lastupdate": "2021-11-30T01:00:48.225308Z"
  }
]